                            النظام الثنائي
 تم ذكر أن النظام العشري يتكون من عشرة أرقام، فالمثل النظام الثنائي يتكون رقمين و هما الصفر و الواحد، و
مثل الطريقة العشرية عند انتهاء الرقم يتم إضافة الرقم صفر ثم يزيد بواحد، كما الحال في المثال:
١١١ ١١٠ ١٠١ ١٠٠ ١١ ١٠ ١ ٠
والملاحظ أن النظام يتكون من الرقمين و هما الصفر والواحد، فيتم البدء بالصفر ثم الواحد و بعد ذلك يتم إضافة
واحد مكان الصفر، و يتم إضافة واحد بجانب الرقم بعد الانتهاء من الأرقام “ وفي هذه الحالة المقصود بالأرقام التي
تنتهي هما الصفر و الواحد“
و ملحوظة مهمة انه عند كتابة الرقم ١٠١١٠٠ بالنظام الثنائي، فلا يقرأ بطريقة مئة وعشرة آلاف و مئة و لكن يقرأ
واحد صفر واحد واحد صفر صفر.
و القاعدة هي: أنه عندما يتم الوصول إلى الرقم صاحب الترتيب وهو الذي يساوي أساس نظام العد، و هذا في النظام
الثنائي فيتم وضع الرقم صفر في الخانة الحالية، مع إضافة الرقم واحد في الجهة التالية له.
تحديد العدد الثنائي إلى العدد العشري
في حالة تحويل الأعداد الثنائية إلى أعداد عشرية عن طريق استخدام مفهوم قيمة المرتبة، يتم ضرب كل رقم من أرقام
الأعداد الثنائية بقيمة المرتبة المقابلة، ويتم تجميع الأعداد مع العلم أن قيمة المرتبة الأولى في نظام الأعداد الثنائية ، و
الثانية ٢ و المرتبة الثالثة ٤ والرابعة ٨ و هكذا.
                                 مثال
طريقة مفهوم القيمة المرتبة
الرقم (١١١١ )وهو بالنظام الثنائي و المطلوب تحويله إلى النظام العشري:
١٥ = (٨ ×١ )+(٤ ×١ )+(٢ ×١ )+(١ ×١ )
١٥ = ٨ + ٤ + ٢ + ١
                               مثال آخر

المطلوب تحويل الرقم (١١٠٠١)إلى عشري باستخدام مفهوم قيمة المرتبة.
٢٥ = ( ١٦ × ١ )+ (٨ × ١)+(٤ × ٠ )+(٢ × ٠ )+(١ × ١ ) : كتابة يتم
٢٥ = ١٦ + ٨ + ٠ + ٠ + ١


                             -:نظام عد ستة عشري
                                           - :مقدمة
                   في الرياضيات وفي الحوسبة، نظام العد الست عشري
 (Hexadecimal Numerical System)‏ هو ترميز عددي ذو مراتب على أساس صحيح هو 16.
     تُستخدم الرموز {0، 1، 2، 3، 4، 5، 6، 7، 8، 9، F، E، D، C، B، A}
 لتمثيل قيم الأعداد ضمن أول خانة بترتيب تصاعدي بحسب تسلسل ورودها، ثم 
يعاد استخدامها من جديد في كتابة بقية الخانات بحسب قيمة العدد.

              -: التحويل من بين النظامين الست عشري والعشري
لتحويل الأعداد الصحيحة الموجبة من النظام العشري إلى السداسي عشر: نستعمل طريقة الباقي وذلك بالقسمة على الأساس 16.

                   -:التحويل بين النظامين الست عشري والثنائي 
               لتحويل أي عدد صحيح من النظام الست عشري إلى الثنائي نتبع الآتي:
1. نستبدل الخانات المكتوبة بدلالة الحروف إن وجدت في العدد بالأعداد العشرية المكافئة لها.
2. نستبدل كل عدد عشري بمكافئه الثنائي المكون من أربعة خانات.
3. ثم نضم الأرقام الثنائية مع بعضها لنحصل على العدد المطلوب

                   -:التحويل من النظام الثنائي إلى الست عشر	
لتحويل أي عدد صحيح من النظام الثنائي إلى الست عشري نتبع الآتي:
1 نقسم العدد الثنائي إلى مجموعات كل منها يتكون من 4 خانات مع مراعاة أن يبدأ التقسيم من الرقم الأقل أهمية (LSD).
2 إذا كانت المجموعة الأخيرة غير مكتملة فإننا نضيف في نهايتها الصفر حتى تصبح مكونة من أربعة خانات:
1101 1100 1011 1101 0100 0001
3 نحول كل مجموعة ثنائية إلى مكافئها في النظام العشري
4 نستبدل كل رقم عشري (من الخطوة السابقة) أكبر من 9 بدلالة حروف النظام الست عشري
5.نضم الأرقام الناتجة مع بعضها لنحصل على الجواب المطلوب في النظام الست عشري
6.إذا كان العدد الثنائي كسراً نبدأ بالتقسيم إلى مجموعات من الخانة القريبة على الفاصلة ثم نتبع باقي الخطوات المشروحة سابقاً
